In [1]:
import pandas as pd
df=pd.read_csv('sample_data.csv')
df.head()

   ID     Name   Age  Gender   Income         City
0   1    Alice  25.0  Female  50000.0     New York
1   2      Bob  30.0    Male  60000.0  Los Angeles
2   3  Charlie  35.0    Male      NaN      Chicago
3   4    David   NaN    Male  80000.0      Houston
4   5      Eve  40.0  Female  75000.0      Phoenix

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   Name    5 non-null      object
 2   Age     4 non-null      float64
 3   Gender  5 non-null      object
 4   Income  4 non-null      float64
 5   City    5 non-null      object
dtypes: float64(2), int64(1), object(3)
memory usage: 372.0+ bytes

In [5]:
df.isnull().sum()

ID        0
Name      0
Age       1
Gender    0
Income    1
City      0
dtype: int64

In [23]:
df1=df.dropna(axis=0)

In [25]:
df1

   ID   Name   Age  Gender   Income         City
0   1  Alice  25.0  Female  50000.0     New York
1   2    Bob  30.0    Male  60000.0  Los Angeles
4   5    Eve  40.0  Female  75000.0      Phoenix

In [19]:
df1.isnull().sum()

ID        0
Name      0
Age       0
Gender    0
Income    0
City      0
dtype: int64

In [32]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()

# Apply Label Encoding to a column
df1["Gender"] = label_encoder.fit_transform(df1["Gender"])

print(df1.head())

   ID   Name   Age  Gender   Income         City
0   1  Alice  25.0       0  50000.0     New York
1   2    Bob  30.0       1  60000.0  Los Angeles
4   5    Eve  40.0       0  75000.0      Phoenix

C:\Users\maluk\AppData\Local\Temp\ipykernel_30236\672001749.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["Gender"] = label_encoder.fit_transform(df1["Gender"])

In [34]:
df1["City"] = label_encoder.fit_transform(df1["City"])

C:\Users\maluk\AppData\Local\Temp\ipykernel_30236\3016930660.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["City"] = label_encoder.fit_transform(df1["City"])

In [36]:
df1

   ID   Name   Age  Gender   Income  City
0   1  Alice  25.0       0  50000.0     1
1   2    Bob  30.0       1  60000.0     0
4   5    Eve  40.0       0  75000.0     2

In [40]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
df1[['Age' ,'Income']]=scaler.fit_transform(df1[['Age','Income']])
df1

C:\Users\maluk\AppData\Local\Temp\ipykernel_30236\216469561.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[['Age' ,'Income']]=scaler.fit_transform(df1[['Age','Income']])

   ID   Name       Age  Gender    Income  City
0   1  Alice -1.069045       0 -1.135550     1
1   2    Bob -0.267261       1 -0.162221     0
4   5    Eve  1.336306       0  1.297771     2